nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
/*
    * Copyright 2024 NXP
    *
    * SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MC56F81768
package_id: MC56F81768LVLH
mcu_data: ksdk2_0
processor_version: 0.15.0
pin_labels:
- {pin_num: '37', pin_signal: GPIOC11/LP_SCLS0/LP_SCL1/TXD1/PWMA_0X, label: USB_SCI_TX}
- {pin_num: '38', pin_signal: GPIOC12/LP_SDAS0/LP_SDA1/RXD1/PWMA_1X, label: USB_SCI_RX}
- {pin_num: '59', pin_signal: GPIOF7/CMPC_O/LP_SDAS1/XB_IN3, label: LED_G, identifier: LED_G}
- {pin_num: '58', pin_signal: GPIOF6/PWMA_3X/LP_SCLS1/XB_IN2, label: LED_R, identifier: LED_R}
- {pin_num: '27', pin_signal: GPIOB2/ANB2/VREFHB/CMPC_IN3, label: CUR_DCB}
- {pin_num: '15', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1/OPAMPA_IN1, label: VOLT_DCB}
- {pin_num: '16', pin_signal: GPIOA3/ANA3/VREFLA/CMPA_IN2/OPAMPA_IN2, label: CUR_C}
- {pin_num: '24', pin_signal: GPIOB0/ANB0/CMPB_IN3/OPAMPB_IN3, label: CUR_B}
- {pin_num: '13', pin_signal: GPIOA0/ANA0/CMPA_IN3/OPAMPA_IN3/CMPC_O, label: CUR_A}
- {pin_num: '49', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B, label: SW5, identifier: SW5}
- {pin_num: '5', pin_signal: GPIOC2/TXD0/XB_OUT11/XB_IN2/CLKO0, label: OSBDM_TX}
- {pin_num: '7', pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1, label: OSBDM_RX}
- {pin_num: '41', pin_signal: GPIOF4/TXD1/XB_OUT8/PWMA_0X/PWMA_FAULT6, label: LED_B, identifier: LED_B}
- {pin_num: '42', pin_signal: GPIOF5/RXD1/XB_OUT9/PWMA_1X/PWMA_FAULT7, label: LED_Y, identifier: LED_Y}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "fsl_xbara.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '37', peripheral: QSCI1, signal: TXD, pin_signal: GPIOC11/LP_SCLS0/LP_SCL1/TXD1/PWMA_0X}
  - {pin_num: '38', peripheral: QSCI1, signal: RXD, pin_signal: GPIOC12/LP_SDAS0/LP_SDA1/RXD1/PWMA_1X}
  - {pin_num: '45', peripheral: PWMA, signal: 'B, 0', pin_signal: GPIOE0/PWMA_0B/XB_OUT4}
  - {pin_num: '46', peripheral: PWMA, signal: 'A, 0', pin_signal: GPIOE1/PWMA_0A/XB_OUT5}
  - {pin_num: '47', peripheral: PWMA, signal: 'B, 1', pin_signal: GPIOE2/PWMA_1B/XB_OUT6}
  - {pin_num: '48', peripheral: PWMA, signal: 'A, 1', pin_signal: GPIOE3/PWMA_1A/XB_OUT7}
  - {pin_num: '51', peripheral: PWMA, signal: 'B, 2', pin_signal: GPIOE4/PWMA_2B/XB_IN2/LP_SCL1/XB_OUT8}
  - {pin_num: '52', peripheral: PWMA, signal: 'A, 2', pin_signal: GPIOE5/PWMA_2A/XB_IN3/LP_SDA1/XB_OUT9}
  - {pin_num: '59', peripheral: GPIOF, signal: 'GPIO, 7', pin_signal: GPIOF7/CMPC_O/LP_SDAS1/XB_IN3, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '58', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/PWMA_3X/LP_SCLS1/XB_IN2, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '27', peripheral: CMPC, signal: 'IN, 3', pin_signal: GPIOB2/ANB2/VREFHB/CMPC_IN3}
  - {pin_num: '15', peripheral: ADC, signal: 'ANA, 2', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1/OPAMPA_IN1}
  - {pin_num: '16', peripheral: ADC, signal: 'ANA, 3', pin_signal: GPIOA3/ANA3/VREFLA/CMPA_IN2/OPAMPA_IN2}
  - {pin_num: '24', peripheral: ADC, signal: 'ANB, 0', pin_signal: GPIOB0/ANB0/CMPB_IN3/OPAMPB_IN3}
  - {pin_num: '13', peripheral: ADC, signal: 'ANA, 0', pin_signal: GPIOA0/ANA0/CMPA_IN3/OPAMPA_IN3/CMPC_O}
  - {pin_num: '49', peripheral: GPIOC, signal: 'GPIO, 13', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
  - {peripheral: ADC, signal: 'SYNC, 0', pin_signal: PWMA0_OUT_TRIG0}
  - {peripheral: PWMA, signal: 'FAULT, 0', pin_signal: CMPC_OUT}
  - {pin_num: '41', peripheral: GPIOF, signal: 'GPIO, 4', pin_signal: GPIOF4/TXD1/XB_OUT8/PWMA_0X/PWMA_FAULT6, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '42', peripheral: GPIOF, signal: 'GPIO, 5', pin_signal: GPIOF5/RXD1/XB_OUT9/PWMA_1X/PWMA_FAULT7, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '54', peripheral: QDC, signal: 'PHASE, A', pin_signal: GPIOE7/PWMA_3A/XB_IN5/XB_OUT11}
  - {pin_num: '50', peripheral: QDC, signal: 'PHASE, B', pin_signal: GPIOF1/CLKO1/XB_IN7/CMPD_O}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOA0 (pin 13) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOA0 (pin 13) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_A0_ANA0_and_CMPA_IN3_and_OPAMPA_IN3);
    /* Enable peripheral functionality on pin GPIOA2 (pin 15) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA3 (pin 16) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB0 (pin 24) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB2 (pin 27) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin11, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C11_TXD1);
    /* Enable peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin12, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C12_RXD1);
    /* GPIO functionality on pin GPIOC13 (pin 49) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_SW5_GPIO, BOARD_INITPINS_SW5_PIN_MASK, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E0_PWMA_0B);
    /* Enable peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E1_PWMA_0A);
    /* Enable peripheral functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E2_PWMA_1B);
    /* Enable peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E3_PWMA_1A);
    /* Enable peripheral functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E4_PWMA_2B);
    /* Enable peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin5, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E5_PWMA_2A);
    /* Enable peripheral functionality on pin GPIOE7 (pin 54) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin7, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE7 (pin 54) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E7_XB_IN5);
    /* Enable peripheral functionality on pin GPIOF1 (pin 50) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF1 (pin 50) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F1_XB_IN7);
    /* GPIO functionality on pin GPIOF4 (pin 41) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_LED_B_GPIO, BOARD_INITPINS_LED_B_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF5 (pin 42) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_LED_Y_GPIO, BOARD_INITPINS_LED_Y_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_LED_R_GPIO, BOARD_INITPINS_LED_R_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF7 (pin 59) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_LED_G_GPIO, BOARD_INITPINS_LED_G_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOC13 (pin 49)  */
    GPIO_PinSetDirection(BOARD_INITPINS_SW5_GPIO, BOARD_INITPINS_SW5_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF4 (pin 41)  */
    GPIO_PinWrite(BOARD_INITPINS_LED_B_GPIO, BOARD_INITPINS_LED_B_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INITPINS_LED_B_GPIO, BOARD_INITPINS_LED_B_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF5 (pin 42)  */
    GPIO_PinWrite(BOARD_INITPINS_LED_Y_GPIO, BOARD_INITPINS_LED_Y_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INITPINS_LED_Y_GPIO, BOARD_INITPINS_LED_Y_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(BOARD_INITPINS_LED_R_GPIO, BOARD_INITPINS_LED_R_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INITPINS_LED_R_GPIO, BOARD_INITPINS_LED_R_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF7 (pin 59)  */
    GPIO_PinWrite(BOARD_INITPINS_LED_G_GPIO, BOARD_INITPINS_LED_G_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INITPINS_LED_G_GPIO, BOARD_INITPINS_LED_G_PIN_MASK, kGPIO_DigitalOutput);

    /* Interrupt configuration on GPIOC13 (pin 49): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_INITPINS_SW5_GPIO, BOARD_INITPINS_SW5_PIN_MASK, kGPIO_InterruptFallingEdge);

    /* Internal Peripheral Select */
    /* Select SCI1_RXD Input.: Select SCI1_RXD Input, GPIOC12 or GPIOF5. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI1_RXDInputIndex, kSIM_SCI1_RXDInput_GPIOC12_GPIOF5);

    /* CMPC_OUT output assigned to XBARA_IN14 input is connected
     * to XBARA_OUT29 output assigned to PWMA_FAULT0 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpcOut, kXBARA_OutputPwmaFault0);
    /* XB_IN5 output assigned to XBARA_IN5 input is connected
     * to XBARA_OUT42 output assigned to QDC_PHA */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputXbIn5, kXBARA_OutputQdcPha);
    /* XB_IN7 output assigned to XBARA_IN7 input is connected
     * to XBARA_OUT43 output assigned to QDC_PHB */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputXbIn7, kXBARA_OutputQdcPhb);
    /* PWMA0_OUT_TRIG0 output assigned to XBARA_IN28 input is connected
     * to XBARA_OUT12 output assigned to ADC_SYNC0 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputPwma0OutTrig0, kXBARA_OutputAdcSync0);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
